<?xml version="1.0" ?>
<net batch="1" name="human-pose-estimation-3d" version="6">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="401" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="3456"/>
				<biases offset="3480" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="403" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="404" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3608" size="1152"/>
				<biases offset="4760" size="128"/>
			</blobs>
		</layer>
		<layer id="5" name="406" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="407" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4888" size="8192"/>
				<biases offset="13080" size="256"/>
			</blobs>
		</layer>
		<layer id="7" name="409" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="410" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13336" size="2304"/>
				<biases offset="15640" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="412" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="413" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15896" size="32768"/>
				<biases offset="48664" size="512"/>
			</blobs>
		</layer>
		<layer id="11" name="415" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="416" precision="FP32" type="Convolution">
			<data dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
			<blobs>
				<weights offset="49176" size="4608"/>
				<biases offset="53784" size="512"/>
			</blobs>
		</layer>
		<layer id="13" name="418" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="419" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
			<blobs>
				<weights offset="54296" size="65536"/>
				<biases offset="119832" size="512"/>
			</blobs>
		</layer>
		<layer id="15" name="421" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="422" precision="FP32" type="Convolution">
			<data dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="120344" size="4608"/>
				<biases offset="124952" size="512"/>
			</blobs>
		</layer>
		<layer id="17" name="424" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="425" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="125464" size="131072"/>
				<biases offset="256536" size="1024"/>
			</blobs>
		</layer>
		<layer id="19" name="427" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="428" precision="FP32" type="Convolution">
			<data dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="257560" size="9216"/>
				<biases offset="266776" size="1024"/>
			</blobs>
		</layer>
		<layer id="21" name="430" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="431" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="267800" size="262144"/>
				<biases offset="529944" size="1024"/>
			</blobs>
		</layer>
		<layer id="23" name="433" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="434" precision="FP32" type="Convolution">
			<data dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="530968" size="9216"/>
				<biases offset="540184" size="1024"/>
			</blobs>
		</layer>
		<layer id="25" name="436" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="437" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="541208" size="524288"/>
				<biases offset="1065496" size="2048"/>
			</blobs>
		</layer>
		<layer id="27" name="439" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="440" precision="FP32" type="Convolution">
			<data dilations="2,2" group="512" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1067544" size="18432"/>
				<biases offset="1085976" size="2048"/>
			</blobs>
		</layer>
		<layer id="29" name="442" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="443" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1088024" size="1048576"/>
				<biases offset="2136600" size="2048"/>
			</blobs>
		</layer>
		<layer id="31" name="445" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="446" precision="FP32" type="Convolution">
			<data dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2138648" size="18432"/>
				<biases offset="2157080" size="2048"/>
			</blobs>
		</layer>
		<layer id="33" name="448" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="449" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2159128" size="1048576"/>
				<biases offset="3207704" size="2048"/>
			</blobs>
		</layer>
		<layer id="35" name="451" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="452" precision="FP32" type="Convolution">
			<data dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3209752" size="18432"/>
				<biases offset="3228184" size="2048"/>
			</blobs>
		</layer>
		<layer id="37" name="454" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="455" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3230232" size="1048576"/>
				<biases offset="4278808" size="2048"/>
			</blobs>
		</layer>
		<layer id="39" name="457" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="458" precision="FP32" type="Convolution">
			<data dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4280856" size="18432"/>
				<biases offset="4299288" size="2048"/>
			</blobs>
		</layer>
		<layer id="41" name="460" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="461" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4301336" size="1048576"/>
				<biases offset="5349912" size="2048"/>
			</blobs>
		</layer>
		<layer id="43" name="463" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="464" precision="FP32" type="Convolution">
			<data dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5351960" size="18432"/>
				<biases offset="5370392" size="2048"/>
			</blobs>
		</layer>
		<layer id="45" name="466" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="467" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5372440" size="1048576"/>
				<biases offset="6421016" size="2048"/>
			</blobs>
		</layer>
		<layer id="47" name="469" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="470" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6423064" size="262144"/>
				<biases offset="6685208" size="512"/>
			</blobs>
		</layer>
		<layer id="49" name="471" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="472" precision="FP32" type="Convolution">
			<data dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6685720" size="4608"/>
			</blobs>
		</layer>
		<layer id="51" name="473" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="474" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6690328" size="65536"/>
			</blobs>
		</layer>
		<layer id="53" name="475" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="476" precision="FP32" type="Convolution">
			<data dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6755864" size="4608"/>
			</blobs>
		</layer>
		<layer id="55" name="477" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="478" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6760472" size="65536"/>
			</blobs>
		</layer>
		<layer id="57" name="479" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="480" precision="FP32" type="Convolution">
			<data dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6826008" size="4608"/>
			</blobs>
		</layer>
		<layer id="59" name="481" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="482" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6830616" size="65536"/>
			</blobs>
		</layer>
		<layer id="61" name="483" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="484" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="485" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6896152" size="589824"/>
				<biases offset="7485976" size="512"/>
			</blobs>
		</layer>
		<layer id="64" name="486" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="487" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7486488" size="589824"/>
				<biases offset="8076312" size="512"/>
			</blobs>
		</layer>
		<layer id="66" name="488" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="489" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8076824" size="589824"/>
				<biases offset="8666648" size="512"/>
			</blobs>
		</layer>
		<layer id="68" name="490" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="491" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8667160" size="589824"/>
				<biases offset="9256984" size="512"/>
			</blobs>
		</layer>
		<layer id="70" name="492" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="493" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9257496" size="262144"/>
				<biases offset="9519640" size="2048"/>
			</blobs>
		</layer>
		<layer id="72" name="494" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="495" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="19" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>19</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9521688" size="38912"/>
				<biases offset="9560600" size="76"/>
			</blobs>
		</layer>
		<layer id="74" name="496" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9560676" size="262144"/>
				<biases offset="9822820" size="2048"/>
			</blobs>
		</layer>
		<layer id="75" name="497" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="498" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="38" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>38</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9824868" size="77824"/>
				<biases offset="9902692" size="152"/>
			</blobs>
		</layer>
		<layer id="77" name="499" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>19</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>38</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>185</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="500" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>185</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9902844" size="94720"/>
				<biases offset="9997564" size="512"/>
			</blobs>
		</layer>
		<layer id="79" name="501" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="502" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9998076" size="589824"/>
				<biases offset="10587900" size="512"/>
			</blobs>
		</layer>
		<layer id="81" name="504" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="505" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10588412" size="589824"/>
				<biases offset="11178236" size="512"/>
			</blobs>
		</layer>
		<layer id="83" name="507" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="508" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="509" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11178748" size="65536"/>
				<biases offset="11244284" size="512"/>
			</blobs>
		</layer>
		<layer id="86" name="510" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="511" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11244796" size="589824"/>
				<biases offset="11834620" size="512"/>
			</blobs>
		</layer>
		<layer id="88" name="513" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="514" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11835132" size="589824"/>
				<biases offset="12424956" size="512"/>
			</blobs>
		</layer>
		<layer id="90" name="516" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="517" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="518" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12425468" size="65536"/>
				<biases offset="12491004" size="512"/>
			</blobs>
		</layer>
		<layer id="93" name="519" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="520" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12491516" size="589824"/>
				<biases offset="13081340" size="512"/>
			</blobs>
		</layer>
		<layer id="95" name="522" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="523" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13081852" size="589824"/>
				<biases offset="13671676" size="512"/>
			</blobs>
		</layer>
		<layer id="97" name="525" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="526" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="527" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13672188" size="65536"/>
				<biases offset="13737724" size="512"/>
			</blobs>
		</layer>
		<layer id="100" name="528" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="529" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13738236" size="589824"/>
				<biases offset="14328060" size="512"/>
			</blobs>
		</layer>
		<layer id="102" name="531" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="532" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14328572" size="589824"/>
				<biases offset="14918396" size="512"/>
			</blobs>
		</layer>
		<layer id="104" name="534" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="535" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="536" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14918908" size="65536"/>
				<biases offset="14984444" size="512"/>
			</blobs>
		</layer>
		<layer id="107" name="537" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="538" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14984956" size="589824"/>
				<biases offset="15574780" size="512"/>
			</blobs>
		</layer>
		<layer id="109" name="540" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="541" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15575292" size="589824"/>
				<biases offset="16165116" size="512"/>
			</blobs>
		</layer>
		<layer id="111" name="543" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="544" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
